//package array;
//
///**
// * @Author czgggggggg
// * @Date 2021/8/27
// * @Description
// */
//public class Array1089 {
//    public static void main(String[] args) {
//
//    }
//    public static void duplicateZeros(int[] arr) {
//
//    }
//}
////[1,0,0,2,3,4,5]
////[1,
////[1,0,0                 tmp = 0
////[1,0,0,0,0             tmp = 2
////[1,0,0,0,0,2           tmp应该为3，但是已经被覆盖掉了，无法得知
////[1,0,0,0,0,2,3]
////-----------------------
////[1,0,2,3,0,4,5,6,7,8]
////[1,
////[1,0,0,
////[1,0,0,2,
////[1,0,0,2,3,
////[1,0,0,2,3,0,0,
////[1,0,0,2,3,0,0,4....
//
